# data_Encoding

In [52]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [53]:
dataset=pd.read_csv("World_Marriage_Dataset.csv")

In [54]:
dataset.head(5)

,Sr.No.,Country,AgeGroup,Sex,MaritalStatus,DataProcess,Data Collection (Start Year),Data Collection (End Year),Data Source
0,1,Afghanistan,[15-19],Man,Divorced,Survey,1972,1974,National statistics
1,2,Afghanistan,[20-24],Man,Divorced,Survey,1972,1974,National statistics
2,3,Afghanistan,[25-29],Man,Divorced,Survey,1972,1974,National statistics
3,4,Afghanistan,[30-34],Man,Divorced,Survey,1972,1974,National statistics
4,5,Afghanistan,[35-39],Man,Divorced,Survey,1972,1974,National statistics

In [55]:
dataset.isnull().sum()

Sr.No.                          0
Country                         0
AgeGroup                        0
Sex                             0
MaritalStatus                   0
DataProcess                     0
Data Collection (Start Year)    0
Data Collection (End Year)      0
Data Source                     0
dtype: int64

In [56]:
en_data=dataset[["Sex"]]

In [57]:
en_data

          Sex
0         Man
1         Man
2         Man
3         Man
4         Man
...       ...
271599  Woman
271600  Woman
271601  Woman
271602  Woman
271603  Woman

[271604 rows x 1 columns]

In [58]:
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271604 entries, 0 to 271603
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Sex_Man    271604 non-null  bool
 1   Sex_Woman  271604 non-null  bool
dtypes: bool(2)
memory usage: 530.6 KB

In [59]:
from sklearn.preprocessing import OneHotEncoder

In [60]:
ohe=OneHotEncoder(drop="first")
ar=ohe.fit_transform(en_data).toarray()
ar

array([[0.],
       [0.],
       [0.],
       ...,
       [1.],
       [1.],
       [1.]])

In [61]:
pd.DataFrame(ar,columns=["Sex_Woman"])

        Sex_Woman
0             0.0
1             0.0
2             0.0
3             0.0
4             0.0
...           ...
271599        1.0
271600        1.0
271601        1.0
271602        1.0
271603        1.0

[271604 rows x 1 columns]

In [ ]:
x=[1,2,3,4,5,6]

In [ ]:
plt.bar(dataset["Country"],dataset["Sex"])